---
type: ParameterValue
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# ParameterValue

`Autodesk.Revit.DB.ParameterValue` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Copy | 2016 Subscription Update | `public ParameterValue Copy ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsEqual | 2016 Subscription Update | `public bool IsEqual ( ParameterValue other )` |
| Method | IsSameType | 2016 Subscription Update | `public bool IsSameType ( ParameterValue other )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |